SoyVitouPro/ESP32-V2/src/main.cpp
// ESP32 HUB75 + WebServer pipeline:
// - Browser renders Khmer text (proper shaping) to Canvas
// - Canvas is cropped and converted to RGB565 in JS
// - Browser uploads RGB565 blob to ESP32
// - ESP32 displays the uploaded bitmap on the HUB75 panel

#include <Arduino.h>
#include <WiFi.h>
#include <WebServer.h>
#include <FS.h>
#include <LittleFS.h>
#include <HTTPClient.h>
#include <WiFiClientSecure.h>
#include <ESP32-VirtualMatrixPanel-I2S-DMA.h>
#include <string.h>
#include <vector>
#include <nvs_flash.h>
#include <nvs.h>
#include "esp_system.h"
#include "esp_heap_caps.h"
#include <driver/i2s.h>

// Panel configuration (defaults). Adjust via UI if needed.
#ifndef PANEL_RES_X
#define PANEL_RES_X 128
#endif
#ifndef PANEL_RES_Y
#define PANEL_RES_Y 64
#endif
#ifndef NUM_ROWS
#define NUM_ROWS 1
#endif
#ifndef NUM_COLS
#define NUM_COLS 1
#endif
#define PANEL_CHAIN (NUM_ROWS * NUM_COLS)

// Runtime layout (allows switching panel configurations without recompiling)
static int cur_rows = NUM_ROWS;   // current layout rows
static int cur_cols = NUM_COLS;   // current layout cols
static inline int VIRT_W() { return cur_cols * PANEL_RES_X; }
static inline int VIRT_H() { return cur_rows * PANEL_RES_Y; }

// Panel chain orientation mapping (do not define macros with same names as enum constants)
// Legacy workflow used numeric defines like 0x02; with the current library use enum values.
// To mirror/reverse horizontally as per your request to switch from 0x02 to 0x01,
// set VIRTUAL_MATRIX_CHAIN_TYPE to CHAIN_BOTTOM_RIGHT_UP instead of CHAIN_BOTTOM_LEFT_UP.
#define VIRTUAL_MATRIX_CHAIN_TYPE CHAIN_BOTTOM_RIGHT_UP

// GPIO mapping

// Define GPIO Pins for ESP32-S3-WROOM-1
#define R1_PIN 4
#define G1_PIN 5
#define B1_PIN 6
#define R2_PIN 7
#define G2_PIN 15
#define B2_PIN 16
#define A_PIN 17
#define B_PIN 18
#define C_PIN 8
#define D_PIN 3
#define E_PIN 46
#define LAT_PIN 9
#define OE_PIN 10
#define CLK_PIN 11

MatrixPanel_I2S_DMA *dma_display = nullptr;
VirtualMatrixPanel  *vdisplay = nullptr;

// Wi-Fi SoftAP config
static const char* AP_SSID = "KHMER_PANEL";
static const char* AP_PASS = "12341234"; // 8+ chars required

WebServer server(80);

// CORS headers for cross-origin requests
void sendCORSHeaders() {
  server.sendHeader("Access-Control-Allow-Origin", "*");
  server.sendHeader("Access-Control-Allow-Methods", "GET, POST, OPTIONS");
  server.sendHeader("Access-Control-Allow-Headers", "Content-Type");
}

// ================= I2S Tick-Tock Sound (MAX98357A) =================
// I2S pins — ensure they are not used by HUB75
#define I2S_DOUT 12
#define I2S_BCLK 13
#define I2S_LRC  14
#define I2S_PORT I2S_NUM_0
#define SAMPLE_RATE 16000

static bool i2sReady = false;
enum SoundMode { SOUND_OFF=0, SOUND_CRICK=1, SOUND_SOFT=2, SOUND_WOOD=3, SOUND_BEEP=4 };
static volatile SoundMode gSoundMode = SOUND_CRICK;
static volatile int gSoundVolume = 80; // 0..100 percent

static void setupI2S() {
  if (i2sReady) return;
  i2s_config_t i2s_config = {
    .mode = (i2s_mode_t)(I2S_MODE_MASTER | I2S_MODE_TX),
    .sample_rate = SAMPLE_RATE,
    .bits_per_sample = I2S_BITS_PER_SAMPLE_16BIT,
    .channel_format = I2S_CHANNEL_FMT_RIGHT_LEFT,
    .communication_format = I2S_COMM_FORMAT_STAND_I2S,
    .intr_alloc_flags = ESP_INTR_FLAG_LEVEL1,
    .dma_buf_count = 4,
    .dma_buf_len = 128,
    .use_apll = true,
    .tx_desc_auto_clear = true,
    .fixed_mclk = 0
  };
  i2s_pin_config_t pin_config = {
    .bck_io_num = I2S_BCLK,
    .ws_io_num = I2S_LRC,
    .data_out_num = I2S_DOUT,
    .data_in_num = I2S_PIN_NO_CHANGE
  };
  if (i2s_driver_install(I2S_PORT, &i2s_config, 0, NULL) != ESP_OK) {
    Serial.println("i2s_driver_install failed");
    return;
  }
  if (i2s_set_pin(I2S_PORT, &pin_config) != ESP_OK) {
    Serial.println("i2s_set_pin failed");
    return;
  }
  i2s_zero_dma_buffer(I2S_PORT);
  i2sReady = true;
}

static bool writeI2SBuffer(int16_t* buf, size_t samplesStereo) {
  size_t bytesToWrite = samplesStereo * sizeof(int16_t);
  size_t bytesWritten = 0;
  esp_err_t err = i2s_write(I2S_PORT, (const void*)buf, bytesToWrite, &bytesWritten, portMAX_DELAY);
  return (err == ESP_OK) && (bytesWritten == bytesToWrite);
}

static void playTick() {
  // Realistic "tick": short, bright band-passed noise burst with fast decay
  const int duration_ms = 22; // ~22 ms
  const int samples = (SAMPLE_RATE * duration_ms) / 1000;
  const float dt = 1.0f / (float)SAMPLE_RATE;
  // Band-pass via 1st-order highpass -> 1st-order lowpass
  const float fcHP = 1500.0f; // remove rumble
  const float fcLP = 6000.0f; // keep bright click (wider)
  const float RC_HP = 1.0f / (2.0f * (float)M_PI * fcHP);
  const float RC_LP = 1.0f / (2.0f * (float)M_PI * fcLP);
  const float aHP = RC_HP / (RC_HP + dt);
  const float aLP = dt / (RC_LP + dt);
  const float amp = 30000.0f; // higher base amplitude
  // Map 0..100 to 0..4.0 (allow up to ~4x loudness at 100)
  const float vol = fmaxf(0.0f, fminf((float)gSoundVolume / 25.0f, 4.0f));

  int16_t* buffer = (int16_t*)malloc(samples * 2 * sizeof(int16_t));
  if (!buffer) return;
  float xPrev = 0.0f, yHP = 0.0f, yBP = 0.0f;
  uint32_t seed = micros();
  for (int i = 0; i < samples; ++i) {
    // white noise in [-1,1]
    seed = 1664525U * seed + 1013904223U;
    float wn = ((int32_t)(seed >> 9) % 2048) / 1024.0f - 1.0f;
    // highpass
    yHP = aHP * (yHP + wn - xPrev);
    xPrev = wn;
    // lowpass on highpass result (band-pass approx)
    yBP += aLP * (yHP - yBP);
    // fast exponential decay envelope
    float env = expf(-6.0f * (float)i / (float)samples);
    int16_t s = (int16_t)fmaxf(fminf(yBP * amp * env * vol, 32767.0f), -32768.0f);
    buffer[i*2] = s; buffer[i*2+1] = s;
  }
  writeI2SBuffer(buffer, samples * 2);
  free(buffer);
}

static void playTock() {
  // Deeper "tock": lower resonant tone with slight downward pitch glide and slower decay
  const int duration_ms = 55; // ~55 ms
  const int samples = (SAMPLE_RATE * duration_ms) / 1000;
  const float fStart = 900.0f, fEnd = 600.0f; // glide
  const float amp = 26000.0f;
  const float vol = fmaxf(0.0f, fminf((float)gSoundVolume / 25.0f, 4.0f));

  int16_t* buffer = (int16_t*)malloc(samples * 2 * sizeof(int16_t));
  if (!buffer) return;
  float phase = 0.0f;
  for (int i = 0; i < samples; ++i) {
    float t = (float)i / (float)(samples - 1);
    float f = fStart + (fEnd - fStart) * t;
    float step = 2.0f * (float)M_PI * f / (float)SAMPLE_RATE;
    // exponential decay envelope
    float env = expf(-3.5f * t);
    float sF = sinf(phase) * amp * env * vol;
    int16_t s = (int16_t)fmaxf(fminf(sF, 32767.0f), -32768.0f);
    buffer[i*2] = s; buffer[i*2+1] = s;
    phase += step; if (phase > 2.0f * (float)M_PI) phase -= 2.0f * (float)M_PI;
  }
  writeI2SBuffer(buffer, samples * 2);
  free(buffer);
}

// One-shot trigger, called per second from client for tight sync
static void triggerTickTockOnce() {
  setupI2S();
  if (!i2sReady) return;
  switch (gSoundMode) {
    case SOUND_OFF: break;
    case SOUND_CRICK: playTick(); break;
    case SOUND_SOFT: {
      // softer version of tick
      const int duration_ms = 16;
      const int samples = (SAMPLE_RATE * duration_ms) / 1000;
      const float dt = 1.0f / (float)SAMPLE_RATE;
      const float fcHP = 1000.0f, fcLP = 3500.0f;
      const float RC_HP = 1.0f / (2.0f * (float)M_PI * fcHP);
      const float RC_LP = 1.0f / (2.0f * (float)M_PI * fcLP);
      const float aHP = RC_HP / (RC_HP + dt);
      const float aLP = dt / (RC_LP + dt);
      const float amp = 14000.0f;
      const float vol = fmaxf(0.0f, fminf((float)gSoundVolume / 100.0f, 1.0f));
      int16_t* buffer = (int16_t*)malloc(samples * 2 * sizeof(int16_t)); if (!buffer) return;
      float xPrev=0,yHP=0,yBP=0; uint32_t seed=micros();
      for (int i=0;i<samples;++i){ seed=1664525U*seed+1013904223U; float wn=((int32_t)(seed>>9)%2048)/1024.0f-1.0f; yHP=aHP*(yHP+wn-xPrev); xPrev=wn; yBP+=aLP*(yHP-yBP); float env=expf(-5.0f*(float)i/(float)samples); int16_t s=(int16_t)fmaxf(fminf(yBP*amp*env*vol,32767.0f),-32768.0f); buffer[i*2]=s; buffer[i*2+1]=s; }
      writeI2SBuffer(buffer, samples * 2); free(buffer);
      break; }
    default: break;
  }
}

// YouTube config
static const char* YT_API_KEY = "AIzaSyCAKj7eDgmQm4B2b9OFyKFLvgiLEjrOoNo";
static const char* YT_CHANNEL_ID = "UCaPOzWiPWJFJr9dXzkkvUOw";
static String gYTChannelId; // override from NVS
static unsigned long yt_last_fetch = 0;
static String yt_cached_json;
static String yt_cached_subs;
static String yt_last_id;

