SoyVitouPro/ESP32-V2/src/main.cpp
// Uploaded text bitmap (RGB565), text-only cropped image
static std::vector<uint8_t> uploadBuf;      // raw bytes as received (header + pixels)
static std::vector<uint16_t> textPixels;    // pixels only, RGB565
static std::vector<uint8_t>  textAlpha;     // optional A8 alpha per pixel
static std::vector<uint16_t> frameBuffer;   // full virtual offscreen RGB565
static std::vector<uint16_t> bgPixels;      // optional background image (virtual-sized)
static bool hasBgImage = false;
static uint16_t imgW = 0, imgH = 0;         // text image size
// Panel config (for multi-panel awareness)
static int g_panel_rows = NUM_ROWS; // hardware default rows
static int g_panel_cols = NUM_COLS; // hardware default cols
static String g_panel_map; // optional: comma-separated indices/names from UI
static std::vector<uint8_t> g_panel_active; // 1=enabled, 0=disabled per physical panel index

// Render settings from client
static uint16_t bgColor = 0x0000;           // RGB565 background
static uint16_t textColor = 0xFFFF;          // ADD: RGB565 text color
static int16_t userOffX = 0;                // base X offset
static int16_t userOffY = 0;                // base Y offset
static bool animate = false;                // scroll enable
static int8_t animDir = -1;                 // -1 = left, +1 = right
static uint16_t animSpeedMs = 30;           // delay between frames (10..60)
static int16_t  loopOffsetPx = 0;           // loop overlap/gap in pixels: <0 overlap, >0 gap

// Animation state
static int16_t scrollX = 0;                 // current scroll position (left of text)
static int16_t baseY = 0;                   // vertically centered baseline + userOffY
static uint32_t lastAnim = 0;
static uint32_t restartAt = 0;              // time to restart next cycle
static bool waitingRestart = false;
static std::vector<int16_t> heads;         // multi-head array for continuous text stream

// ================= Alpha Blending Helpers (RGB565) =================
static inline uint16_t blend565(uint16_t src565, uint16_t dst565, uint8_t a) {
  if (a == 0) return dst565;
  if (a == 255) return src565;
  // Extract to 8-bit components
  uint8_t sr = (src565 >> 8) & 0xF8; sr |= sr >> 5;
  uint8_t sg = (src565 >> 3) & 0xFC; sg |= sg >> 6;
  uint8_t sb = (src565 << 3) & 0xF8; sb |= sb >> 5;
  uint8_t dr = (dst565 >> 8) & 0xF8; dr |= dr >> 5;
  uint8_t dg = (dst565 >> 3) & 0xFC; dg |= dg >> 6;
  uint8_t db = (dst565 << 3) & 0xF8; db |= db >> 5;
  // Alpha blend: out = (src*a + dst*(255-a)) / 255
  uint16_t ia = 255 - a;
  uint8_t r = (uint8_t)((sr * a + dr * ia + 127) / 255);
  uint8_t g = (uint8_t)((sg * a + dg * ia + 127) / 255);
  uint8_t b = (uint8_t)((sb * a + db * ia + 127) / 255);
  // Pack back to 565
  return ((r & 0xF8) << 8) | ((g & 0xFC) << 3) | (b >> 3);
}

// Display mode tracking
enum DisplayMode { MODE_NONE, MODE_CLOCK, MODE_THEME };
static DisplayMode currentMode = MODE_NONE;

// Persistent storage structure
struct LastSettings {
  bool animate;
  int8_t animDir;
  uint16_t animSpeedMs;
  uint8_t speedPercent;      // ADD: Speed percentage (10-100) for proper saving/loading
  int16_t loopOffsetPx;
  uint16_t bgColor;
  uint16_t textColor;        // ADD: Text color
  uint16_t brightness;
  DisplayMode mode;
  bool hasText;
  bool hasBgImage;
  uint16_t textWidth;
  uint16_t textHeight;
  int16_t scrollX;           // Current scroll position
  uint16_t spacing;          // Animation spacing
  uint32_t savedTime;        // When the state was saved
};

static LastSettings lastSettings = {0};
static std::vector<uint16_t> lastFrameBuffer;  // Store last displayed frame
static uint8_t currentBrightness = 200;  // Track current brightness
static uint32_t lastSaveTime = 0;  // Track when we last saved the frame

// Panel helpers
static inline int panelIndexFromXY(int x, int y) {
  int col = x / PANEL_RES_X;
  int row = y / PANEL_RES_Y;
  return row * cur_cols + col; // row-major for current layout
}

static void maskDisabledPanels() {
  if (g_panel_active.empty()) return;
  for (int row = 0; row < g_panel_rows; ++row) {
    for (int col = 0; col < g_panel_cols; ++col) {
      int idx = row * g_panel_cols + col;
      if (idx < (int)g_panel_active.size() && g_panel_active[idx] == 0) {
        int x0 = col * PANEL_RES_X;
        int y0 = row * PANEL_RES_Y;
        for (int y = 0; y < PANEL_RES_Y; ++y) {
          size_t base = (size_t)(y0 + y) * (size_t)VIRT_W() + (size_t)x0;
          for (int x = 0; x < PANEL_RES_X; ++x) {
            frameBuffer[base + (size_t)x] = 0x0000; // force black on disabled panel
          }
        }
      }
    }
  }
}

static const char* panelLabelForIndex(int idx) {
  static const char* labels[] = {"main","second","third","fourth","fifth","sixth","seventh","eighth"};
  int n = sizeof(labels)/sizeof(labels[0]);
  if (idx >= 0 && idx < n) return labels[idx];
  return "panel";
}

// Persistent storage functions
static void saveLastSettings() {
  nvs_handle_t nvs_handle;
  esp_err_t err = nvs_open("storage", NVS_READWRITE, &nvs_handle);
  if (err != ESP_OK) {
    Serial.printf("Error opening NVS: %s\n", esp_err_to_name(err));
    return;
  }

  // Update current settings
  lastSettings.animate = animate;
  lastSettings.animDir = animDir;
  lastSettings.animSpeedMs = animSpeedMs;
  lastSettings.loopOffsetPx = loopOffsetPx;
  lastSettings.bgColor = bgColor;
  lastSettings.textColor = textColor;  // ADD: Save text color
  lastSettings.mode = currentMode;
  lastSettings.hasText = !textPixels.empty();
  lastSettings.hasBgImage = hasBgImage;
  lastSettings.textWidth = imgW;
  lastSettings.textHeight = imgH;

  // Save current animation state - SIMPLE VERSION
  lastSettings.scrollX = scrollX;
  lastSettings.spacing = imgW + loopOffsetPx;
  lastSettings.savedTime = millis();

  // Save settings to NVS
  nvs_set_u8(nvs_handle, "animate", lastSettings.animate ? 1 : 0);
  nvs_set_i8(nvs_handle, "animDir", lastSettings.animDir);
  nvs_set_u16(nvs_handle, "animSpeedMs", lastSettings.animSpeedMs);
  nvs_set_u8(nvs_handle, "speedPercent", lastSettings.speedPercent);
  Serial.printf("Saving speed: percentage=%d%%, animSpeedMs=%d ms\n", lastSettings.speedPercent, lastSettings.animSpeedMs);
  nvs_set_i16(nvs_handle, "loopOffsetPx", lastSettings.loopOffsetPx);
  nvs_set_u16(nvs_handle, "bgColor", lastSettings.bgColor);
  nvs_set_u16(nvs_handle, "textColor", lastSettings.textColor);  // ADD: Save text color
  nvs_set_u8(nvs_handle, "mode", static_cast<uint8_t>(lastSettings.mode));
  nvs_set_u8(nvs_handle, "hasText", lastSettings.hasText ? 1 : 0);
  nvs_set_u8(nvs_handle, "hasBgImage", lastSettings.hasBgImage ? 1 : 0);
  nvs_set_u16(nvs_handle, "textWidth", lastSettings.textWidth);
  nvs_set_u16(nvs_handle, "textHeight", lastSettings.textHeight);

