SoyVitouPro/ESP32-V2/src/main.cpp
    sendCORSHeaders();
    if (new_rows == cur_rows && new_cols == cur_cols) { server.send(200, "text/plain", "OK"); return; }

    // Recreate virtual panel with new layout
    cur_rows = new_rows; cur_cols = new_cols;
    if (vdisplay) { delete vdisplay; vdisplay = nullptr; }
    vdisplay = new VirtualMatrixPanel(*dma_display, cur_rows, cur_cols, PANEL_RES_X, PANEL_RES_Y, VIRTUAL_MATRIX_CHAIN_TYPE);
    vdisplay->fillScreen(0);

    // Resize buffers and clear
    frameBuffer.assign((size_t)VIRT_W() * (size_t)VIRT_H(), 0);
    if (hasBgImage) {
      // Invalidate bg if size mismatch; user can re-upload
      if (bgPixels.size() != frameBuffer.size()) { hasBgImage = false; bgPixels.clear(); }
    }

    // Redraw seam guides
    if (cur_cols > 1) { for (int y = 0; y < VIRT_H(); ++y) vdisplay->drawPixel(PANEL_RES_X, y, vdisplay->color565(0,64,255)); }
    if (cur_rows > 1) { for (int x = 0; x < VIRT_W(); ++x) vdisplay->drawPixel(x, PANEL_RES_Y, vdisplay->color565(0,64,255)); }

    // Adjust active mask to hardware count (1 panel)
    g_panel_active.assign((size_t)cur_rows * (size_t)cur_cols, 1);
    sendCORSHeaders();
    server.send(200, "text/plain", "OK");
  });
  // Panel info endpoint (detected/configured count)
  server.on("/panel_info", HTTP_GET, [](){
    // Report current layout and hardware detected panel count
    String json = "{";
    json += "\"rows\":" + String(cur_rows) + ",";
    json += "\"cols\":" + String(cur_cols) + ",";
    int detected = 1;
    json += "\"detected\":" + String(detected) + ",";
    // labels
    json += "\"labels\":[";
    for (int i = 0; i < detected; ++i) {
      if (i) json += ",";
      json += "\""; json += panelLabelForIndex(i); json += "\"";
    }
    json += "],";
    // active
    json += "\"active\":[";
    for (int i = 0; i < detected; ++i) {
      if (i) json += ",";
      int v = (i < (int)g_panel_active.size()) ? g_panel_active[i] : 0;
      json += String(v);
    }
    json += "]}";
    sendCORSHeaders();
    server.send(200, "application/json", json);
  });
  // WiFi scan endpoint
  server.on("/wifi_scan", HTTP_GET, [](){
    sendCORSHeaders();
    int n = WiFi.scanNetworks();
    String out = "[";
    for (int i = 0; i < n; ++i) {
      if (i) out += ",";
      String ssid = WiFi.SSID(i);
      long rssi = WiFi.RSSI(i);
      bool secure = (WiFi.encryptionType(i) != WIFI_AUTH_OPEN);
      out += "{\"ssid\":\"" + ssid + "\",";
      out += "\"rssi\":" + String((int)rssi) + ",";
      out += "\"secure\":" + String(secure ? "true" : "false") + "}";
    }
    out += "]";
    server.send(200, "application/json", out);
  });
  // WiFi connect endpoint
  server.on("/wifi_connect", HTTP_POST, [](){
    sendCORSHeaders();
    if (!server.hasArg("ssid")) { server.send(400, "application/json", "{\"error\":\"missing ssid\"}"); return; }
    String ssid = server.arg("ssid");
    String pass = server.hasArg("pass") ? server.arg("pass") : "";
    WiFi.mode(WIFI_AP_STA);
    Serial.printf("WiFi: connecting to SSID '%s'...\n", ssid.c_str());
    WiFi.begin(ssid.c_str(), pass.length() ? pass.c_str() : nullptr);
    unsigned long start = millis();
    wl_status_t st;
    while ((st = WiFi.status()) != WL_CONNECTED && (millis() - start) < 10000) {
      delay(250);
    }
    if (WiFi.status() == WL_CONNECTED) {
      IPAddress ip = WiFi.localIP();
      String json = "{\"status\":\"connected\",\"ssid\":\"" + ssid + "\",\"ip\":\"" + ip.toString() + "\"}";
      server.send(200, "application/json", json);
    } else {
      server.send(200, "application/json", "{\"status\":\"failed\"}");
    }
  });
  // WiFi status endpoint
  server.on("/wifi_status", HTTP_GET, [](){
    sendCORSHeaders();
    bool connected = (WiFi.status() == WL_CONNECTED);
    String json = "{";
    json += "\"connected\":"; json += connected ? "true" : "false"; json += ",";
    if (connected) {
      json += "\"ssid\":\"" + WiFi.SSID() + "\",";
      json += "\"ip\":\"" + WiFi.localIP().toString() + "\",";
    }
    json += "\"ap_ip\":\"" + WiFi.softAPIP().toString() + "\"}";
    server.send(200, "application/json", json);
  });
  // Sound control: one-shot tick/tock (client alternates per second)
  server.on("/sound_tick", HTTP_POST, [](){
    sendCORSHeaders();
    triggerTickTockOnce();
    server.send(200, "application/json", "{\"status\":\"ok\"}");
  });
  // Sound mode selection: /sound_set?mode=off|crick|soft
  server.on("/sound_set", HTTP_POST, [](){
    sendCORSHeaders();
    String mode = server.hasArg("mode") ? server.arg("mode") : "";
    mode.toLowerCase();
    if (mode == "off") gSoundMode = SOUND_OFF;
    else if (mode == "crick") gSoundMode = SOUND_CRICK;
    else if (mode == "soft") gSoundMode = SOUND_SOFT;
    server.send(200, "application/json", String("{\"mode\":\"") + mode + "\"}");
  });
  // Sound volume: /sound_volume?level=0..100
  server.on("/sound_volume", HTTP_POST, [](){
    sendCORSHeaders();
    int level = server.hasArg("level") ? server.arg("level").toInt() : 80;
    if (level < 0) level = 0; if (level > 100) level = 100;
    gSoundVolume = level;
    server.send(200, "application/json", String("{\"volume\":") + level + "}");
  });
  // System info endpoint
  server.on("/sys_info", HTTP_GET, [](){
    sendCORSHeaders();
    // Uptime
    uint32_t up = millis();
    // Heap/PSRAM
    size_t heap_free = esp_get_free_heap_size();
    size_t heap_total = heap_caps_get_total_size(MALLOC_CAP_DEFAULT);
    size_t psram_free = heap_caps_get_free_size(MALLOC_CAP_SPIRAM);
    size_t psram_total = heap_caps_get_total_size(MALLOC_CAP_SPIRAM);
    // FS
    size_t fs_total = 0, fs_used = 0;
    if (LittleFS.begin(true)) {
      fs_total = LittleFS.totalBytes();
      fs_used = LittleFS.usedBytes();
    }
    // CPU Freq
    int cpu_mhz = getCpuFrequencyMhz();
    // WiFi RSSI
    int rssi = (WiFi.status() == WL_CONNECTED) ? WiFi.RSSI() : 0;

    String json = "{";
    json += "\"uptime_ms\":" + String(up) + ",";
    json += "\"heap_free\":" + String(heap_free) + ",";
    json += "\"heap_total\":" + String(heap_total) + ",";
    json += "\"psram_free\":" + String(psram_free) + ",";
    json += "\"psram_total\":" + String(psram_total) + ",";
    json += "\"fs_total\":" + String(fs_total) + ",";
    json += "\"fs_used\":" + String(fs_used) + ",";
    json += "\"cpu_freq_mhz\":" + String(cpu_mhz) + ",";
    json += "\"wifi_rssi\":" + String(rssi);
    json += "}";
    server.send(200, "application/json", json);
  });
  // YouTube stats endpoint (cached ~5s)
  server.on("/yt_stats", HTTP_GET, [](){
    sendCORSHeaders();
    // Return cache if fetched within last 10 seconds
    unsigned long now = millis();
    String id = server.hasArg("id") ? server.arg("id") : (gYTChannelId.length() ? gYTChannelId : String(YT_CHANNEL_ID));
    if (yt_cached_json.length() && id == yt_last_id && (now - yt_last_fetch) < 5000UL) {
      server.send(200, "application/json", yt_cached_json);
      return;
    }

