SoyVitouPro/ESP32-V2/src/main.cpp
    if (WiFi.status() != WL_CONNECTED) {
      server.send(200, "application/json", "{\"error\":\"wifi_disconnected\"}");
      return;
    }

    WiFiClientSecure client;
    client.setInsecure(); // skip certificate validation for simplicity
    HTTPClient https;

    String url = String("https://www.googleapis.com/youtube/v3/channels?part=statistics&id=") + id + "&key=" + YT_API_KEY;
    if (!https.begin(client, url)) {
      server.send(200, "application/json", "{\"error\":\"begin_failed\"}");
      return;
    }
    https.setTimeout(4000);
    int code = https.GET();
    if (code <= 0) {
      https.end();
      server.send(200, "application/json", "{\"error\":\"http_failed\"}");
      return;
    }
    String payload = https.getString();
    https.end();

    // Very simple extraction of subscriberCount without ArduinoJson
    String subs;
    int p = payload.indexOf("\"subscriberCount\"");
    if (p >= 0) {
      int colon = payload.indexOf(':', p);
      if (colon > 0) {
        int q1 = payload.indexOf('"', colon+1);
        int q2 = payload.indexOf('"', q1+1);
        if (q1 > 0 && q2 > q1) {
          subs = payload.substring(q1+1, q2);
        }
      }
    }
    if (subs.length() == 0) {
      server.send(200, "application/json", "{\"error\":\"parse_error\"}");
      return;
    }
    yt_cached_subs = subs;
    yt_last_fetch = now;
    yt_last_id = id;
    yt_cached_json = String("{\"subscriberCount\":\"") + subs + "\"}";
    server.send(200, "application/json", yt_cached_json);
  });

  // Simple proxy to fetch remote images (GIF/PNG) to avoid CORS/taint
  server.on("/proxy_image", HTTP_GET, [](){
    sendCORSHeaders();
    if (!server.hasArg("url")) { server.send(400, "text/plain", "missing url"); return; }
    if (WiFi.status() != WL_CONNECTED) { server.send(503, "text/plain", "no internet"); return; }
    String url = server.arg("url");

    WiFiClientSecure client;
    client.setInsecure();
    HTTPClient https;
    if (!https.begin(client, url)) { server.send(500, "text/plain", "begin failed"); return; }
    https.setFollowRedirects(HTTPC_STRICT_FOLLOW_REDIRECTS);
    int code = https.GET();
    if (code <= 0) { https.end(); server.send(502, "text/plain", "fetch failed"); return; }

    String ctype = https.header("Content-Type");
    if (ctype.length() == 0) {
      if (url.endsWith(".gif")) ctype = "image/gif";
      else if (url.endsWith(".png")) ctype = "image/png";
      else ctype = "application/octet-stream";
    }
    WiFiClient *stream = https.getStreamPtr();
    server.setContentLength(CONTENT_LENGTH_UNKNOWN);
    server.send(200, ctype, "");

    uint8_t buf[1024];
    int len;
    while ((len = stream->readBytes(reinterpret_cast<char*>(buf), sizeof(buf))) > 0) {
      server.sendContent_P(reinterpret_cast<const char*>(buf), len);
      delay(0);
    }
    https.end();
  });

  // Download external icon to LittleFS for same-origin use
  server.on("/yt_icon_download", HTTP_POST, [](){
    sendCORSHeaders();
    if (!server.hasArg("url")) { server.send(400, "application/json", "{\"error\":\"missing url\"}"); return; }
    if (WiFi.status() != WL_CONNECTED) { server.send(503, "application/json", "{\"error\":\"no_internet\"}"); return; }
    String url = server.arg("url");

    // Choose client based on scheme
    bool isHttps = url.startsWith("https://");
    std::unique_ptr<WiFiClient> plain(new WiFiClient());
    std::unique_ptr<WiFiClientSecure> secure(new WiFiClientSecure());
    if (isHttps) secure->setInsecure();

    HTTPClient http;
    bool ok = isHttps ? http.begin(*secure, url) : http.begin(*plain, url);
    if (!ok) { server.send(500, "application/json", "{\"error\":\"begin_failed\"}"); return; }
    http.setFollowRedirects(HTTPC_STRICT_FOLLOW_REDIRECTS);
    http.setTimeout(8000);
    int code = http.GET();
    if (code <= 0) { http.end(); server.send(502, "application/json", "{\"error\":\"fetch_failed\"}"); return; }

    String ctype = http.header("Content-Type"); ctype.toLowerCase();
    String ext = ".bin";
    if (ctype.indexOf("gif") >= 0) ext = ".gif";
    else if (ctype.indexOf("png") >= 0) ext = ".png";
    else if (ctype.indexOf("jpeg") >= 0 || ctype.indexOf("jpg") >= 0) ext = ".jpg";
    else {
      // fallback from URL
      if (url.endsWith(".gif")) ext = ".gif";
      else if (url.endsWith(".png")) ext = ".png";
      else if (url.endsWith(".jpg") || url.endsWith(".jpeg")) ext = ".jpg";
    }

    // Remove previous files
    LittleFS.remove("/yt_icon.gif");
    LittleFS.remove("/yt_icon.png");
    LittleFS.remove("/yt_icon.jpg");
    LittleFS.remove("/yt_icon.bin");

    String path = String("/yt_icon") + ext;
    File f = LittleFS.open(path, "w");
    if (!f) { http.end(); server.send(500, "application/json", "{\"error\":\"fs_open_failed\"}"); return; }

    WiFiClient *stream = http.getStreamPtr();
    const size_t maxBytes = 1024 * 1024; // 1MB limit
    uint8_t buf[1024];
    size_t total = 0; int len;
    while ((len = stream->readBytes(reinterpret_cast<char*>(buf), sizeof(buf))) > 0) {
      f.write(buf, len);
      total += len;
      if (total > maxBytes) { f.close(); LittleFS.remove(path); http.end(); server.send(413, "application/json", "{\"error\":\"too_large\"}"); return; }
      delay(0);
    }
    f.close(); http.end();

    String res = String("{\"ok\":true,\"path\":\"") + path + "\"}";
    server.send(200, "application/json", res);
  });

  // Fetch theme IDs from remote API using ESP internet
  server.on("/themes_ids", HTTP_GET, [](){
    sendCORSHeaders();
    if (WiFi.status() != WL_CONNECTED) {
      server.send(503, "application/json", "{\"error\":\"no_internet\"}");
      return;
    }
    const char* url = "https://api.ikhode.com/themes/ids";
    WiFiClientSecure client; client.setInsecure();
    HTTPClient https;
    if (!https.begin(client, url)) { server.send(500, "application/json", "{\"error\":\"begin_failed\"}"); return; }
    https.setFollowRedirects(HTTPC_STRICT_FOLLOW_REDIRECTS);
    https.setTimeout(8000);
    int code = https.GET();
    if (code <= 0) { https.end(); server.send(502, "application/json", "{\"error\":\"fetch_failed\"}"); return; }
    String payload = https.getString();
    https.end();
    server.send(200, "application/json", payload);
  });

  // Download theme file by ID and save as local icon
  server.on("/theme_download", HTTP_POST, [](){
    sendCORSHeaders();
    if (!server.hasArg("id")) { server.send(400, "application/json", "{\"error\":\"missing id\"}"); return; }
    if (WiFi.status() != WL_CONNECTED) { server.send(503, "application/json", "{\"error\":\"no_internet\"}"); return; }
    String id = server.arg("id");
    String url = String("https://api.ikhode.com/themes/") + id + "/file";

