SoyVitouPro/ESP32-V2/src/main.cpp
    // Choose client based on scheme (https)
    WiFiClientSecure client; client.setInsecure();
    HTTPClient http;
    if (!http.begin(client, url)) { server.send(500, "application/json", "{\"error\":\"begin_failed\"}"); return; }
    http.setFollowRedirects(HTTPC_STRICT_FOLLOW_REDIRECTS);
    http.setTimeout(15000);
    int code = http.GET();
    if (code <= 0) { http.end(); server.send(502, "application/json", "{\"error\":\"fetch_failed\"}"); return; }

    String ctype = http.header("Content-Type"); ctype.toLowerCase();
    String ext = ".bin";
    if (ctype.indexOf("gif") >= 0) ext = ".gif";
    else if (ctype.indexOf("png") >= 0) ext = ".png";
    else if (ctype.indexOf("jpeg") >= 0 || ctype.indexOf("jpg") >= 0) ext = ".jpg";

    LittleFS.remove("/yt_icon.gif");
    LittleFS.remove("/yt_icon.png");
    LittleFS.remove("/yt_icon.jpg");
    LittleFS.remove("/yt_icon.bin");

    String path = String("/yt_icon") + ext;
    File f = LittleFS.open(path, "w");
    if (!f) { http.end(); server.send(500, "application/json", "{\"error\":\"fs_open_failed\"}"); return; }
    WiFiClient *stream = http.getStreamPtr();
    const size_t maxBytes = 1024 * 1024; // 1MB cap
    uint8_t buf[1024]; size_t total = 0; int len;
    while ((len = stream->readBytes(reinterpret_cast<char*>(buf), sizeof(buf))) > 0) {
      f.write(buf, len); total += len; if (total > maxBytes) { f.close(); LittleFS.remove(path); http.end(); server.send(413, "application/json", "{\"error\":\"too_large\"}"); return; }
      delay(0);
    }
    f.close(); http.end();
    String res = String("{\"ok\":true,\"path\":\"") + path + "\"}";
    server.send(200, "application/json", res);
  });

  // Stream currently saved icon with CORS for cross-origin preview
  server.on("/yt_icon_current", HTTP_GET, [](){
    sendCORSHeaders();
    const char* candidates[] = { "/yt_icon.gif", "/yt_icon.png", "/yt_icon.jpg", "/yt_icon.bin" };
    const char* types[]      = { "image/gif",  "image/png",   "image/jpeg",  "application/octet-stream" };
    File f; const char* ctype = nullptr;
    for (int i=0;i<4;i++) {
      if (LittleFS.exists(candidates[i])) { f = LittleFS.open(candidates[i], "r"); ctype = types[i]; break; }
    }
    if (!f) { server.send(404, "application/json", "{\"error\":\"not_found\"}"); return; }
    server.streamFile(f, String(ctype));
    f.close();
  });

  // Upload a GIF/PNG icon directly from browser and save in LittleFS
  static File _iconUploadFile;
  static bool _iconUploadOK = false;
  static String _iconSavedPath;
  server.on("/upload_icon", HTTP_POST, [](){
    sendCORSHeaders();
    String res = String("{\"ok\":") + (_iconUploadOK?"true":"false") + ",\"path\":\"" + _iconSavedPath + "\"}";
    server.send(200, "application/json", res);
  }, [](){
    HTTPUpload &up = server.upload();
    if (up.status == UPLOAD_FILE_START) {
      _iconUploadOK = false; _iconSavedPath = "";
      // Default path
      String filename = up.filename;
      filename.toLowerCase();
      String path = "/yt_icon";
      if (filename.endsWith(".gif")) path += ".gif";
      else if (filename.endsWith(".png")) path += ".png";
      else if (filename.endsWith(".jpg") || filename.endsWith(".jpeg")) path += ".jpg";
      else path += ".bin";
      LittleFS.remove("/yt_icon.gif");
      LittleFS.remove("/yt_icon.png");
      LittleFS.remove("/yt_icon.jpg");
      LittleFS.remove("/yt_icon.bin");
      _iconUploadFile = LittleFS.open(path, FILE_WRITE);
      if (_iconUploadFile) _iconSavedPath = path;
    } else if (up.status == UPLOAD_FILE_WRITE) {
      if (_iconUploadFile) _iconUploadFile.write(up.buf, up.currentSize);
    } else if (up.status == UPLOAD_FILE_END) {
      if (_iconUploadFile) { _iconUploadFile.close(); _iconUploadOK = true; }
    }
  });
  // Theme status endpoint
  server.on("/theme_status", HTTP_GET, [](){
    sendCORSHeaders();
    File f = LittleFS.open("/theme.html", "r");
    String status = f ? "{\"theme_uploaded\":true}" : "{\"theme_uploaded\":false}";
    if (f) f.close();
    server.send(200, "application/json", status);
  });
  server.begin();
}

void loop() {
  // Optimize server handling to reduce animation lag
  uint32_t serverStart = millis();
  server.handleClient();
  uint32_t serverTime = millis() - serverStart;

  // Brief yield to ensure smooth clock timing
  if (serverTime > 1) {
    delay(1); // Small delay to prevent blocking
  }

  // Animate if enabled, we have a text bitmap, and we're in clock mode
  if (animate && !textPixels.empty() && currentMode == MODE_CLOCK) {
    uint32_t now = millis();

    // Ultra-fast animation timing optimization
    uint32_t adjustedTime = now;

    // More aggressive compensation for server handling time
    if (serverTime > 2) {
      // Compensate for any server time > 2ms to maintain smooth animation
      adjustedTime = now + (serverTime - 2);
    }

    // Ultra-fast timing check with microsecond precision for smooth animation
    uint32_t timeDiff = adjustedTime - lastAnim;

    // Use sub-millisecond timing for ultra-smooth animation at fastest speeds
    if (timeDiff >= animSpeedMs) {
      // Only log occasionally to avoid Serial Monitor flooding
      static uint32_t debugCounter = 0;
      if (++debugCounter % 200 == 0) { // Log every 200th frame (even less frequent)
        Serial.printf("Smooth animation: speed=%dms, serverTime=%lums, timeDiff=%lums\n", animSpeedMs, serverTime, timeDiff);
      }
      lastAnim = adjustedTime;

      // Optimized background composition - use cached background when possible
      if (hasBgImage && bgPixels.size() == frameBuffer.size()) {
        // Fast copy for background image
        std::copy(bgPixels.begin(), bgPixels.end(), frameBuffer.begin());
      } else {
        // Optimized fill for solid color
        std::fill(frameBuffer.begin(), frameBuffer.end(), bgColor);
      }

      // Optimized text blitting - reduce function call overhead
      const bool hasAlpha = !textAlpha.empty();
      const uint16_t frameW = VIRT_W();

      // Pre-calculate frequently used values
      const int imgH_local = imgH;
      const int imgW_local = imgW;
      const int baseY_local = baseY;
      const int userOffX_local = userOffX;

      // Optimized blit function
      for (int i = 0; i < (int)heads.size(); i++) {
        int16_t x0 = heads[i] + userOffX_local;

